result_probably_consolidated/2core_4iothread/c6620(emerald)_consolidated_2core_8iothread/multiplier_4/run5.txt
# run=5/10
# 2026-04-07T22:46:14-06:00
# cmd: taskset -c 1-55 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            463190
        write:                           120484
        other:                           61844
        total:                           645518
    transactions:                        28759  (478.83 per sec.)
    queries:                             645518 (10747.76 per sec.)
    ignored errors:                      4326   (72.03 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      478.8324
    time elapsed:                        60.0607s
    total number of events:              28759

Latency (ms):
         min:                                    1.87
         avg:                                   66.79
         max:                                  351.56
         95th percentile:                      139.85
         sum:                              1920819.66

Threads fairness:
    events (avg/stddev):           898.7188/15.82
    execution time (avg/stddev):   60.0256/0.02